feat: add integration tests with actual calls
